## **Structured Query Language(SQL)**
- is a `programming language` used for **managing** and **manipulating data** held in a relational database management system (RDBMS).
- specifically designed for interacting with databases. It allows you to perform various operations like **querying** data, **inserting** new records, **updating** existing records, and **deleting** records.

### **Database Structure** 
- In SQL, data is stored in tables, which are organized into databases. 
- Each table consists of **rows** and **columns**. 
- `Rows` represent individual **records**, while `columns` represent **attributes** or **fields** of those records.

## **Import SQLite3**

In [2]:
import sqlite3

# **Create SQLite Database**

In [3]:
conn = sqlite3.connect('sqlite-crud.db')

## **Create a Cursor Object**

- Create a cursor object using the `cursor()` method. The cursor is used to execute SQL commands:

In [ ]:
cursor = conn.cursor()

## **Create Table**
To define and create a new table in a database, you can use the `CREATE TABLE` statement.

In [ ]:

# CREATE TABLE IF NOT EXISTS table-name
# (column-name data_type constraint)
cursor.execute(
"""
    CREATE TABLE IF NOT EXISTS employees (
    employee_id INTEGER PRIMARY KEY AUTOINCREMENT,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
    )
"""
)
conn.commit()

## **Check if the employee table is created successfully.**

In [ ]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' AND name='employees'")
table_exists = cursor.fetchone()
if table_exists:
    print("The table employees exists")
else:
    print("The table employees does not exists")

The table employees exists

## **Deleting a Table**

If you want to delete the entire table, you can use the `DROP TABLE` statement.

In [ ]:
cursor.execute("DROP TABLE employees")
conn.commit()

## **Recreate the Table**

In [ ]:
# CREATE TABLE IF NOT EXISTS table-name
# (column-name data_type constraint)
cursor.execute(
"""
    CREATE TABLE IF NOT EXISTS employees (
    employee_id INTEGER PRIMARY KEY AUTOINCREMENT,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
    )
"""
)
conn.commit()

## **Check the structure of the table**


To display the structure of a table, including its fields (columns) even if it doesn't have any records yet, you can use database-specific commands:

- `cid`: The **column ID**.
- `name`: The **name** of the column.
- `type`: The **data type** of the column.
- `notnull`: Whether the column cannot contain **NULL values**.
- `dflt_value`: The **default value** of the column.
- `pk`: Whether the column is part of the **primary key**.

In [ ]:
cursor.execute("PRAGMA table_info('employees')")
cursor.fetchall()

[(0, 'employee_id', 'INTEGER', 0, None, 1),
 (1, 'first_name', 'VARCHAR(50)', 1, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 1, None, 0),
 (3, 'department', 'VARCHAR(50)', 0, None, 0),
 (4, 'salary', 'DECIMAL(10, 2)', 1, None, 0)]

## **Altering Table**

You might need to alter the table structure at some point.

In [ ]:
cursor.execute("ALTER TABLE employees ADD performance_rating INT")
conn.commit()

## **Inserting Data**

You can insert data into the employees table using the `INSERT INTO` statement.

In [ ]:
cursor.execute("""
INSERT INTO employees 
    (first_name, last_name, department, salary, hire_date, performance_rating)
VALUES 
    ('Jane', 'Smith', 'Marketing', 55000.00, '2024-04-26', 3),
    ('Michael', 'Johnson', 'Sales', 60000.00, '2024-04-27', 5),
    ('Emily', 'Davis', 'Operations', 62000.00, '2024-04-20', 2),
    ('David', 'Wilson', 'Operations', 58000.00, '2024-04-28', 1),
    ('Linda', 'Martinez', 'IT', 70000.00, '2024-04-29', 4),
    ('Robert', 'Anderson', 'Finance', 65000.00, '2024-04-30', 3),
    ('Patricia', 'Taylor', 'HR', 52000.00, '2024-05-01', 5),
    ('Christopher', 'Thomas', 'Marketing', 59000.00, '2024-05-02', 2),
    ('Jennifer', 'Lee', 'Sales', 63000.00, '2024-05-03', 3),
    ('James', 'White', 'Operations', 56000.00, '2024-05-04', 4),
    ('Barbara', 'Harris', 'IT', 68000.00, '2024-05-05', 1),
    ('Daniel', 'Clark', 'Finance', 64000.00, '2024-05-06', 5),
    ('Nancy', 'Lewis', 'HR', 53000.00, '2024-05-07', 2),
    ('Paul', 'Walker', 'Sales', 61000.00, '2024-05-08', 3),
    ('Karen', 'Hall', 'Marketing', 60000.00, '2024-05-09', 4),
    ('Steven', 'Allen', 'IT', 69000.00, '2024-05-10', 5),
    ('Elizabeth', 'Young', 'Finance', 62000.00, '2024-05-11', 2),
    ('George', 'King', 'Operations', 57000.00, '2024-05-12', 3),
    ('Mary', 'Wright', 'HR', 54000.00, '2024-05-13', 4),
    ('Brian', 'Lopez', 'Sales', 62000.00, '2024-05-14', 5),
    ('Megan', 'Hill', 'IT', 71000.00, '2024-05-15', 2),
    ('Anthony', 'Scott', 'Finance', 66000.00, '2024-05-16', 3),
    ('Deborah', 'Green', 'Marketing', 63000.00, '2024-05-17', 4),
    ('Larry', 'Adams', 'Operations', 58000.00, '2024-05-18', 5),
    ('Sarah', 'Nelson', 'HR', 55000.00, '2024-05-19', 2),
    ('Kenneth', 'Carter', 'Sales', 64000.00, '2024-05-20', 3),
    ('Betty', 'Mitchell', 'IT', 72000.00, '2024-05-21', 4),
    ('Ronald', 'Perez', 'Finance', 67000.00, '2024-05-22', 5),
    ('Laura', 'Roberts', 'Marketing', 65000.00, '2024-05-23', 2);
""")

conn.commit()

## **Selecting Data**

You can retrieve data from the employees table using the `SELECT` statement.

In [ ]:
cursor.execute("SELECT * FROM employees")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 50000, '1997-01-07', 2),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

## **Selecting Specific Columns**
To retrieve data from specific columns of a table, you can use the `SELECT` statement with the column names specified.

In [ ]:
cursor.execute("SELECT first_name, last_name, department FROM employees")
cursor.fetchall()

[('John', 'Doe', 'Sales'),
 ('Jane', 'Smith', 'Marketing'),
 ('Michael', 'Johnson', 'Sales'),
 ('Emily', 'Davis', 'Operations'),
 ('David', 'Wilson', 'Operations'),
 ('Linda', 'Martinez', 'IT'),
 ('Robert', 'Anderson', 'Finance'),
 ('Patricia', 'Taylor', 'HR'),
 ('Christopher', 'Thomas', 'Marketing'),
 ('Jennifer', 'Lee', 'Sales'),
 ('James', 'White', 'Operations'),
 ('Barbara', 'Harris', 'IT'),
 ('Daniel', 'Clark', 'Finance'),
 ('Nancy', 'Lewis', 'HR'),
 ('Paul', 'Walker', 'Sales'),
 ('Karen', 'Hall', 'Marketing'),
 ('Steven', 'Allen', 'IT'),
 ('Elizabeth', 'Young', 'Finance'),
 ('George', 'King', 'Operations'),
 ('Mary', 'Wright', 'HR'),
 ('Brian', 'Lopez', 'Sales'),
 ('Megan', 'Hill', 'IT'),
 ('Anthony', 'Scott', 'Finance'),
 ('Deborah', 'Green', 'Marketing'),
 ('Larry', 'Adams', 'Operations'),
 ('Sarah', 'Nelson', 'HR'),
 ('Kenneth', 'Carter', 'Sales'),
 ('Betty', 'Mitchell', 'IT'),
 ('Ronald', 'Perez', 'Finance'),
 ('Laura', 'Roberts', 'Marketing')]

## **Updating Data**

If you want to update existing data, you can use the `UPDATE` statement.

In [ ]:
# UPDATE table-name SET column-name = new_value WHERE primary_key_column = value_row
cursor.execute("""
    UPDATE employees SET salary = 65000.00
    WHERE employee_id = 1
""")
conn.commit()

In [ ]:
cursor.execute("SELECT first_name, last_name, salary FROM employees")
cursor.fetchall()

[('John', 'Doe', 65000),
 ('Jane', 'Smith', 55000),
 ('Michael', 'Johnson', 60000),
 ('Emily', 'Davis', 62000),
 ('David', 'Wilson', 58000),
 ('Linda', 'Martinez', 70000),
 ('Robert', 'Anderson', 65000),
 ('Patricia', 'Taylor', 52000),
 ('Christopher', 'Thomas', 59000),
 ('Jennifer', 'Lee', 63000),
 ('James', 'White', 56000),
 ('Barbara', 'Harris', 68000),
 ('Daniel', 'Clark', 64000),
 ('Nancy', 'Lewis', 53000),
 ('Paul', 'Walker', 61000),
 ('Karen', 'Hall', 60000),
 ('Steven', 'Allen', 69000),
 ('Elizabeth', 'Young', 62000),
 ('George', 'King', 57000),
 ('Mary', 'Wright', 54000),
 ('Brian', 'Lopez', 62000),
 ('Megan', 'Hill', 71000),
 ('Anthony', 'Scott', 66000),
 ('Deborah', 'Green', 63000),
 ('Larry', 'Adams', 58000),
 ('Sarah', 'Nelson', 55000),
 ('Kenneth', 'Carter', 64000),
 ('Betty', 'Mitchell', 72000),
 ('Ronald', 'Perez', 67000),
 ('Laura', 'Roberts', 65000)]

## **Deleting Data**

You can delete data from the table using the `DELETE` statement.

In [ ]:
cursor.execute("DELETE FROM employees WHERE employee_id = 1")
conn.commit()